app/controllers/goals_controller.rb

  def index
  	@goals = Goal.all.id_order
---
SELECT "goals".* FROM "goals"  ORDER BY "goals"."id" DESC

  def show
  	@goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 3]]

  def edit
    @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 5]]

  def create
  	@goal = Goal.new(goal_params)

  	if @goal.save
---
INSERT INTO "goals" ("name", "description", "term", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "1241"], ["description", "32552"], ["term", "2015-07-10 00:00:00.000000"], ["created_at", "2015-07-08 16:18:21.124400"], ["updated_at", "2015-07-08 16:18:21.124400"]]

  def update
    @goal = Goal.find(params[:id])
    if @goal.update(goal_params)
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "goals" SET "description" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["description", "Some particular stuff"], ["updated_at", "2015-07-08 18:08:41.726553"], ["id", 1]]

  def destroy
    @goal = Goal.find(params[:id])
    @goal.destroy
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 6]]